doc/server/pbench-web-server.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>PBench web server</title>
<!-- 2017-12-07 Thu 17:08 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="keywords" content="pbench" />
<link rel="stylesheet" href="../../stylesheets/normalize.css" type="text/css"/>
<link rel="stylesheet" href="../../stylesheets/stylesheet.css" type="text/css"/>
<link rel="stylesheet" href="../../stylesheets/github-light.css" type="text/css"/>
</head>
<body>
<div id="content">
<h1 class="title">PBench web server</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Introduction</a></li>
<li><a href="#sec-2">Installation</a></li>
<li><a href="#sec-3">Local configuration</a></li>
<li><a href="#sec-4">Viewing pbench data locally</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
These are the bits of Javascript, CSS and such that are necessary to render
the graphs that pbench produces. They are packaged up in an RPM for easy installation.
The RPM is used by the pbench server installation, but it can also be used to
allow viewing of pbench graphs locally. This is what is described in this document.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Installation</h2>
<div class="outline-text-2" id="text-2">
<p>
The RPM is available from the standard pbench repo on COPR. If you
have a pbench-agent installed already, the repo should be already
available. If not, consult the <a href="../agent/installation.html">PBench agent installation instructions</a>
for details.
</p>

<p>
Once the repo is installed, the RPM itself can be installed with:
</p>
<pre class="example">
dnf install pbench-web-server
# or ...
yum install pbench-web-server
</pre>
<p>
The RPM defines a <code>post-trans</code> action that uses the <code>Node.js</code> package
manager <code>npm</code> to install various Javascript libraries, in particular
<code>d3</code> and <code>nvd3</code>. The RPM requires the <code>npm</code> package, so if it is not
installed already, it will be installed as a dependency<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>. The action
then calls <code>npm install</code> on the various packages.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Local configuration</h2>
<div class="outline-text-2" id="text-3">
<p>
It is assumed that you have an HTTP server installed and running. Here
I will assume <code>apache</code>, but similar considerations apply to other servers.
</p>

<p>
The HTTP server will need access to the JS/CSS files that the pbench HTML
files require: these are assumed to reside in a subdirectory of the document
root of the server, called <code>static</code>. Assuming that the document root is
the default <code>/var/www/html</code>, the easiest way to accomplish that is to
plant a symlink in the document root that points to the installed <code>static</code>
directory:
</p>
<pre class="example">
ln -sf /opt/pbench-web-server/html/static /var/www/html
</pre>

<p>
In addition, you will need to bring the <code>pbench-agent</code> data directory
into the purview of the server. Again, a symlink is the simplest solution:
</p>
<pre class="example">
ln -sf /var/lib/pbench-agent /var/www/html
</pre>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Viewing pbench data locally</h2>
<div class="outline-text-2" id="text-4">
<p>
Now browse to
</p>
<pre class="example">
http://localhost/pbench-agent
</pre>
<p>
You should be able view graphs on you local system the same way that you can
view graphs on the pbench server.
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
RHEL[6,7] requires the addition of the <a href="https://fedoraproject.org/wiki/EPEL">EPEL</a> repo in order to be
able to get the npm package. 
</p></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="date">Page updated: 2017-12-07 Thu 17:08</p>
</div>
</body>
</html>
